Repository: NetworkBlockDevice/nbd
Catalog: debian/po/*.po
Languages: fi

source: AUTO_GEN is set to "n" in /etc/nbd-client
fi: Asetuksen AUTO_GEN arvo on ”n” tiedostossa /etc/nbd-client

source: The /etc/nbd-client file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
fi: Tiedostossa /etc/nbd-client on rivi, jolla muuttujalle AUTO_GEN asetetaan arvo ”n”. Tästä syystä tiedostoa ei luoda automaattisesti uudelleen.

source: If that's wrong, remove the line and call "dpkg-reconfigure nbd-client" afterwards.
fi: Jos asetus on väärä, poista se ja aja sen jälkeen komento ”dpkg-reconfigure nbd-client”.

source: Number of nbd-client connections to use:
fi: nbd-client-yhteyksien määrä:

source: nbd-client can handle multiple concurrent connections. Please specify the number of connections you'd like this configuration script to set up.
fi: nbd-client voi hallita useampia yhtäaikaisia yhteyksiä. Anna haluttu yhteyksien määrä.

source: Note that if something has already been specified in /etc/nbd-client, the current configuration will be used as defaults in these dialogs.
fi: Jos tiedostossa /etc/nbd-client on jo asetettu jokin määrä, se annetaan oletusarvona tässä kentässä.

source: swap, filesystem, raw
fi: näennäismuisti, tiedostojärjestelmä, raaka

source: Intended use of the network block device number ${number}:
fi: Verkkolohkolaitteen numero ${number} tarkoitettu käyttötapa:

source: The network block device can serve multiple purposes. One of the most interesting is to provide swap space over the network for diskless clients, but you can store a filesystem on it, or do other things with it for which a block device is interesting.
fi: Verkkolohkolaitetta (Network block device) voidaan käyttää moneen tarkoitukseen. Yksi mielenkiintoisimmista on näennäismuistin tarjoaminen levyttömille asiakkaille verkon yli, mutta sille voidaan myös tallentaa tiedostojärjestelmä tai sitä voidaan käyttää muilla lohkolaitteille ominaisilla tavoilla.

source: If you intend to use the network block device as a swap device, choose "swap". If you intend to use it as a filesystem, add a line to /etc/fstab, give it the option "_netdev" (else init will try to mount it before it's usable), and choose "filesystem". For all other purposes, choose "raw". The only thing the nbd-client boot script will do then is start an nbd-client process; you will have to set it up manually.
fi: Jos aiot käyttää verkkolohkolaitetta näennäismuistilaitteena, valitse ”näennäismuisti”. Jos aiot käyttää sitä tiedostojärjestelmänä, lisää rivi tiedostoon /etc/fstab, lisää sille valitsin ”_netdev” (muuten init yrittää liittää sen ennen kuin se on käytettävissä) ja valitse ”tiedostojärjestelmä”. Kaikissa muissa tilanteissa valitse ”raaka”. Tällöin nbd-clientin käynnistyskomentosarja käynnistää ainoastaan nbd-client-prosessin ja kaikki muu täytyy tehdä käsin.

source: Hostname of the server (number: ${number})?
fi: Palvelimen numero ${number} verkkonimi:

source: Please enter the network name or IP address of the machine on which the nbd-server process is running.
fi: Anna sen koneen verkkonimi tai IP-osoite, jolla nbd-server-prosessia ajetaan.

source: Port on which the nbd-server is running (number: ${number})?
fi: Portti, jota nbd-server numero ${number} käyttää:

source: Please enter the TCP port number to access nbd-server.
fi: Anna TCP-portin numero, jonka kautta nbd-serveriin voidaan ottaa yhteys.

source: /dev entry for this nbd-client (number: ${number})?
fi: nbd-clientin numero ${number} /dev-tietue:

source: If the /dev entry specified does not exist, it will be created with minor number ${number}.
fi: Jos annettua /dev-tietuetta ei ole olemassa, se luodaan toissijaisella numerolla ${number}.

source: Disconnect all NBD devices on "stop"?
fi: Irrotetaanko kaikki NBD-laitteet komennolla ”stop”?

source: When the nbd-client init script is called to stop the nbd-client service, there are two things that can be done: either it can disconnect all nbd-client devices (which are assumed not to be in use), or it can disconnect only those nbd-client devices that it knows about in its config file.
fi: Kun nbd-client-palvelu pysäytetään kutsumalla init-komentosarjaa ”nbd-client”, se voi toimia kahdella eri tavalla: se voi joko irrottaa kaikki nbd-client-laitteet (joiden oletetaan olevan poissa käytöstä) tai se voi irrottaa vain ne nbd-client-laitteet, jotka on mainittu sen asetustiedostossa.

source: The default (and the traditional behavior) is to disconnect all nbd-client devices. If the root device or other critical file systems are on NBD this will cause data loss and should not be accepted.
fi: Oletus (ja perinteinen toimintatapa) on kaikkien nbd-client-laitteiden irrotus. Jos juurilaite tai jokin muu kriittinen tiedostojärjestelmä on liitetty NBD:n avulla, tämä aiheuttaa tietojen häviämistä, eikä tätä vaihtoehtoa tulisi valita.

source: Number of nbd-server instances to run:
fi: Ajettavien nbd-server-instanssien lukumäärä:

source: Multiple nbd-server processes may run to export multiple files or block devices. Please specify how many configurations for such servers you want to generate.
fi: Useita tiedostoja tai lohkolaitteita voidaan laittaa saataville ajamalla useampia nbd-server-prosesseja. Valitse monenko palvelimen asetukset haluat luoda.

source: Note that you can always add extra servers by adding them to /etc/nbd-server/config, or by running "dpkg-reconfigure nbd-server".
fi: Voit lisätä palvelimia lisäämällä ne tiedostoon /etc/nbd-server/config tai ajamalla komennon ”dpkg-reconfigure nbd-server”.

source: TCP Port for server number ${number}:
fi: Palvelimen numero ${number} TCP-portti:

source: Please specify the TCP port this instance of nbd server will use for listening. As NBD is likely to use more than one port, no dedicated port has been assigned in IANA lists.
fi: Anna TCP-portti, jota tämä nbd-server kuuntelee. Koska NBD yleensä kuuntelee useampaa kuin yhtä porttia, sille ei ole varattu tiettyä porttia IANA-listoilta.

source: Therefore, NBD does not have a standard port number, which means you need to provide one. You should make sure this port is not already in use.
fi: Tästä syystä NBD:llä ei ole standardia porttinumeroa ja sinun tulee valita numero. Varmista, ettei valittu portti ole jo käytössä.

source: File to export (server number ${number}):
fi: Tiedosto, jonka palvelin numero ${number} tarjoaa käyttöön:

source: Please specify a file name or block device that should be exported over the network. You can export a real block device (for instance "/dev/hda1"); a normal file (such as "/export/nbd/bl1"); or a bunch of files all at once. For the third option, you can use "%s" in the filename, which will be expanded to the IP-address of the connecting client. An example would be "/export/swaps/swp%s".
fi: Anna tiedostonimi tai lohkolaite, jonka haluat laittaa saataville verkon yli. Voit jakaa todellisen lohkolaitteen (esimerkiksi ”/dev/hda1”), tavallisen tiedoston (kuten ”/export/nbd/bl1”) tai joukon tiedostoja kerralla. Kolmatta vaihtoehtoa varten voit käyttää tiedostonimessä merkkijonoa ”%s”, joka muutetaan yhteyden ottavan asiakkaan IP-osoitteeksi. Esimerkki tästä on ”/export/swaps/swp%s”.

source: Note that it is possible to tune the way in which the IP address will be substituted in the file name. See "man 5 nbd-server" for details.
fi: Tapaa, jolla IP-osoite korvaa tiedostonimessä olevan merkkijonon voi muokata. Lisätietoja löytyy man-ohjesivulta nbd-server(5).

source: AUTO_GEN is set to "n" in /etc/nbd-server
fi: Asetuksen AUTO_GEN arvo on ”n” tiedostossa /etc/nbd-server

source: The /etc/nbd-server file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
fi: Tiedostossa /etc/nbd-server on rivi, jolla muuttujalle AUTO_GEN asetetaan arvo ”n”. Tästä syystä tiedostoa ei luoda automaattisesti uudelleen.

source: Note that the current version of the nbd-server package no longer uses /etc/nbd-server. Instead it uses a new configuration file, read by nbd-server itself (rather than the init script), which supports more options. See "man 5 nbd-server" for details.
fi: Paketin nbd-server nykyinen versio ei enää käytä tiedostoa /etc/nbd-server. Sen sijaan se käyttää uutta useampia valitsimia tukevaa asetustiedostoa, jonka nbd-server lukee itse (init-komentosarjan sijaan). Lisätietoja löytyy man-ohjesivulta nbd-server(5).

source: If you remove or comment out the AUTO_GEN line, a file /etc/nbd-server/config in the new format may be generated based on the current configuration. Until then, the nbd-server installation will be broken.
fi: Jos poistat tai laitat kommentteihin AUTO_GEN-rivin, tiedosto /etc/nbd-server/config voidaan luoda uudessa muodossa nykyisten asetusten pohjalta. Tätä ennen nbd-server-asennus ei toimi.

source: Convert old-style nbd-server configuration file?
fi: Muunnetaanko nbd-serverin vanhan muotoinen asetustiedosto?

source: A pre-2.9 nbd-server configuration file has been found on this system. The current nbd-server package no longer supports this file and will not work if it is kept as is.
fi: Järjestelmästä löytyi paketin nbd-server versiota 2.9 vanhempi asetustiedosto. Nykyinen nbd-server-paketti ei enää tue tätä tiedostoa, eikä toimi, jos tilanne säilytetään nykyisellään.

source: If you choose this option, the system will generate a new style configuration file based upon the old-style configuration file, which will be removed. Otherwise, configuration questions will be asked and the system will generate a new configuration file.
fi: Jos valitset tämän vaihtoehdon, järjestelmään luodaan vanhan asetustiedoston pohjalta uusi asetustiedosto ja vanha poistetaan. Muussa tapauksessa uusi asetustiedosto luodaan myöhemmin esitettävien asetuskysymysten avulla.

source: If a new-style configuration file already exists and you choose this option, you will shortly see a "modified configuration file" prompt, as usual.
fi: Jos valitset tämän vaihtoehdon ja uuden muotoinen asetustiedosto on jo olemassa, näytetään asennusprosessin aikana normaali kysymys paikallisesti muokatusta asetustiedostosta.
